app/views/courses/index.html.erb

SELECT "courses".* FROM "courses"
SELECT COUNT(*) FROM "courses"
---

<% if !Course.all.empty?  %>