app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
    def index
        @course = Course.all

INSERT INTO "courses" ("name", "typeOfEvent", "instructor", "additionalInfo", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Unod"], ["typeOfEvent", ""], ["instructor", ""], ["additionalInfo", ""], ["description", ""], ["created_at", "2016-11-26 12:36:21.501594"], ["updated_at", "2016-11-26 12:36:21.501594"]]
---
    def create
        @course = Course.new(course_params)
        if @course.save

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "courses" SET "name" = ?, "additionalInfo" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["name", "ba Course"], ["additionalInfo", ""], ["updated_at", "2016-11-26 14:00:50.617118"], ["id", 2]]
---
    def update
        @course = Course.find(params[:id])
        if @course.update_attributes(course_params)